Repository: mozilla-l10n/mt-training-data
Catalog: ig/ig_pontoon.tmx
Source language: en_us
Languages: ig

source: Stop watching this thread
ig: Kwụsị ịlele usoro a

source: <strong>0</strong> questions in the last <strong>24 hours</strong> have no reply. <strong>Good job!</strong>
ig: <strong>0</strong> ajụjụ n'ime <strong>aka elekere 24 gara aga</strong> nwere nzaghachi. <strong>Ezigbo ọrụ!</strong>

source: <strong>%(awarder)s</strong> has awarded you the <strong>%(title)s</strong> badge!
ig: <strong>%(awarder)s</strong> enyela gị akara <strong>%(title)s</strong>!

source: <strong>{product}</strong> Support Forum
ig: <strong>{product}</strong> Ọgbakọ Nkwado

source: <strong>%(recent_unanswered_count)s question</strong> has no reply.
ig: <strong>%(recent_unanswered_count)s ajụjụ</strong> enweghị nzaghachi.<strong>ajụjụ %(recent_unanswered_count)s</strong> enweghị nzaghachi.

source: <strong>%(recent_unanswered_count)s</strong> question in the last <strong>24 hours</strong> has no reply. <a href="%(url)s">Help solve it!</a>
ig: <strong>%(recent_unanswered_count)s</strong> ajụjụ n'ime <strong>aka elekere 24 gara aga</strong> enweghị nzaghachi. <a href="%(url)s">Nyere aka kpezie ya!</a>

source: <strong>Warning:</strong> Accounts created before December 2010 may have issues logging in. Please reset your password below.
ig: <strong>Ịdọ aka na ntị:</strong> Akaụntụ ndị emepụtara tupu Disemba 2010 nwere ike ịnwe nsogbu ịbanye. Biko tọgharịa okwuntughe gị n'okpuru.

source: <strong>Warning:</strong> This revision has KB Helpfulness Votes associated with it. Deleting this revision will cause those votes to be deleted as well.
ig: <strong>Ịdọ aka na ntị:</strong> Ngụgharị a nwere Ntuli Aka Ịba Uru KB ejikọtara na ya. Ihichapụ ngụgharị a ga-eme ka ehichapụkwa ntuli aka ndị ahụ.

source: Subject:
ig: Isiokwu:

source: Submit for Review
ig: Nyefee maka Nyocha

source: Submit Issue
ig: Nyefee Nsogbu

source: Submitted {locale} translation:
ig: Nyefere ntụgharị asụsụ {locale}:

source: Submitted revision:
ig: Ngụgharị enyefere:

source: Submitted Revision Changes
ig: Mgbanwe Ngụgharị Ndị Enyefere

source: Submitted translation:
ig: Ntụgharị asụsụ enyefere:

source: Submitted Translation Changes
ig: Mgbanwe Ntụgharị Asụsụ Enyefere

source: Submit Your Changes
ig: Nyefee Mgbanwe Gị

source: Subscribe...
ig: Debanye aha...

source: Subscribe to edit notifications
ig: Debanye aha iji dezie amamọkwa

source: Subscribe to feed
ig: Debanye aha na ngụpụta

source: Subscription confirmed.
ig: Ekwenyere na ndebanye.

source: Successfully activated
ig: Agbalitere na enweghị nsogbu

source: Summarize your question in a sentence
ig: Chịkọta ajụjụ gị n'otu ahịrịokwu

source: Summary:
ig: Nchịkọta:

source: [SUMO] You have a new private message from [{sender}]
ig: [SUMO] Ị nwere ozi nzuzo ọhụrụ sitere na [{sender}]

source: Support article:
ig: Edemede nkwado:

source: Support Forum
ig: Ọgbakọ Nkwado

source: Support Forum Home
ig: Ụlọ Ọgbakọ Nkwado

source: Support Forum Metrics
ig: Metrik Ọgbakọ Nkwado

source: Support Questions
ig: Ajụjụ Nkwado

source: Support URL: {support_url}
ig: URL Nkwado: {support_url}

source: Switch language
ig: Gbanwee asụsụ

source: Switch to desktop site
ig: Banye na saịtị desktọpụ

source: Switch to edit mode
ig: Banye n'ụkpụrụ ndezi

source: Switch to mobile site
ig: Banye na saịtị mkpanaka

source: Switch to preview mode
ig: Banye na ụkpụrụ nhụchalụ

source: sync
ig: mmekọrịta

source: System
ig: Sistemụ

source: System Details
ig: Nkọwapụta Sistemụ

source: Systems and Languages
ig: Sistemụ na Asụsụ

source: Tab basics
ig: Ntọala taabụ

source: Table of Contents
ig: Tebul nke Ọdịnaya

source: Tabs
ig: Taabụ

source: Tab settings
ig: Ntọala taabụ

source: tag1, tag2
ig: mkpado1, mkpado2

source: Tags
ig: Mkpado

source: Take Action:
ig: Lenye Anya:

source: Take pictures, record videos and listen to music on your Firefox OS phone.
ig: Seta foto, dekọọ vidio ma gee egwu na ekwentị Firefox OS gị.

source: Tap here to go to the mobile version of the site.
ig: Pịa ebe a iji gaa na ụdị mkpanaka nke saịtị ahụ.

source: {t} | {d} Discussion | Knowledge Base
ig: {t} | {d} Mkparịta Ụka | Ọdụ Nghọta

source: Tell us about yourself!
ig: Gwakwuo anyị ihe gbasara gị!

source: Tell us more.
ig: Gwakwuo anyị ihe.

source: Templates
ig: Ndebiri

source: Templates are a way of reusing pieces of content across KB articles. You can create and update a set of instructions in one place, and then refer to it in other pages.
ig: Ndebiri bụ ụzọ nke ijigharịa mpekere nke ọdịnaya n'ofe edemede KB. Ị nwere ike ịmepụta ma melite ngwungwu nke ntuziaka n'otu ebe, ma rụtụ aka na ya n'ibe ndị ọzọ.

source: Text of the new revision:
ig: Edemede nke ngụgharị ọhụrụ:

source: Thanks,
ig: Daalụ,

source: Thanks!
ig: Daalụ!

source: Thanks for joining Mozilla Support! To complete registration, you need to verify your email address.
ig: Daalụ maka isonye Nkwado Mozilla! Iji mezuo ndebanye, ị ga-enyocha adreesị email gị.

source: Thanks for letting us know you have this problem.
ig: Daalụ maka ịme ka anyị mara na ị nwere nsogbu a.

source: Thanks for making us better!
ig: Daalụ maka ịme ka anyị ka mma!

source: Thanks for taking the time to review these changes. Clicking Accept will make this version of the article live! Please take a moment to be sure all options are correct.
ig: Daalụ maka iwe obere oge iji nyochaa mgbanwe ndị a. Ịpị Nabata ga-eme ka ụdị nke edemede a dị ire! Biko were obere oge iji hụ na nhọrọ niile ziri ezi.

source: Thanks for taking the time to review these changes. Please thank the editor and then give specific, constructive feedback about what you feel needs to change in order for the revision to be acceptable.
ig: Daalụ maka iwepụta oge iji nyochaa mgbanwe ndị a. Biko kelee onye ndezi ahụ wee nye ya nzaghachi akọwara nke ọma gbasara ihe ị chere ekwesịrị ịgbanwe iji nabata ngụgharị ahụ.

source: Thanks for your help! Just so you know, Firefox OS is not available in your locale yet, and it's possible this article will change before it is.
ig: Daalụ maka enyemaka gị! Ka ị mara, Firefox OS adịbeghị na mpaghara gị, edemede a nwere ike ịgbanwe tupu ọ dị.

source: Thanks so much for your interest in helping users of Mozilla technologies!
ig: Daalụ nke ukwuu maka mmasị gị na ịnyere ndị ọrụ nke teknụzụ Mozilla aka!

source: Thanks, The Mozilla Support team
ig: Daalụ, otu Nkwado Mozilla

source: Thank you for being awesome!
ig: Daalụ maka ịgba oke mbọ!

source: Thank you for choosing a solution!
ig: Daalụ mka ịhọrọ otu asịsa!

source: Thank you for registering!
ig: Daalụ maka ịdebanye aha!

source: Thank you for your contribution to Mozilla Support!
ig: Daalụ maka ntinye aka gị na Nkwado Mozilla!

source: Thank you for your first contribution to the Mozilla support forums! You just made somebody's day!
ig: Daalụ maka nkwado izizi gị na ọgbakọ nkwado Mozilla! Ị meere mmadụ ezigbo ihe taa!

source: Thank you once more. We are looking forward to seeing you more often around SUMO! Keep rocking!
ig: Daalụ ọzọ. Anyị na atụ anya ịhụ gị kwa oge na SUMO! Gaa n'ihu na amuke!

source: Thank you! Your question will appear on the site as soon as you confirm your email address. You should receive an email shortly with a link to confirm.
ig: Daalụ! Ajụjụ gị ga-egosi na saịtị ahụ ozugbo ị kwenyere na adreesị email gị. Ị kwesịrị ịnweta email n'obere oge nwere njikọ iji kwenye.

source: That e-mail address doesn't have an associated user account. Are you sure you've registered?
ig: Adreesị e-mail ahụ enweghị akaụntụ onye ọrụ ejikọtara. Ị dị njikere na ị debanyela aha?

source: That tag does not exist.
ig: Mkpado ahụ adịghị adị.

source: The basics of using bookmarks
ig: Ntọala nke iji bukumakị

source: The body content is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ig: Ọdịnaya ahụ dị oke mkpụmkpụ (mkpụrụedemede %(show_value)s). Ọ ga-abụrịrị opekata mpe mkpụrụedemede %(limit_value)s.

source: The community forum is at %(url)s .
ig: Ọgbakọ ogbe ahụ dị na %(url)s .

source: The dashboard data is being loaded. This may take some time.
ig: A na adọnye data ogwe ahụ. Nke a nwere ike iwe obere oge.

source: The {default_locale} version has no approved content to show.
ig: Ụdị {default_locale} enweghị ọdịnaya akwadoro igosi.

source: The document %(document_title)s has a new revision that is ready for localization.
ig: Dọkụmentị %(document_title)s nwere ngụgharị ọhụrụ dị nkwadobe maka ntụgharị asụsụ.

source: The document has been deleted.
ig: Ehichapụla dọkụmentị ahụ.

source: The document "%s" does not exist.
ig: Dọkụmentị "%s" adịghị adị.

source: The {domain} team
ig: Otu {domain}

source: The email you entered ({new_email}) already exists in the system. The current email for your account is still {old_email}.
ig: Email i tinyere ({new_email}) adịlarịị na sistemụ. Email maka akaụntụ gị dị ugbu a ka bụ {old_email}.

source: The flag is invalid.
ig: Ọkọlọtọ ahụ ezighi ezi.

source: The flag is valid and I fixed the issue.
ig: Ọkọlọtọ ahụ ziri ezi, edoziri nsogbu ahụ.

source: The following articles include this image:
ig: Edemede ndị a gụnyere onyonyo a:

source: The image "%s" does not exist.
ig: Onyonyo "%s" adịghị adị.

source: The message was deleted!
ig: Ehichapụrụ ozi ahụ!

source: The Mozilla Support team
ig: Otu Nkwado Mozilla

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
ig: Njikọ ntọgharị okwuntughe ahụ anaghị arụ ọrụ n'ihi ejirila ya. Biko rịọ ntọgharị okwuntughe ọhụrụ.

source: The question:
ig: Akapụtara ajụjụ ahụ:

source: The questions forum isn't available for {product} in {old_lang}, we have redirected you to the {new_lang} questions forum.
ig: Ọgbakọ ajụjụ adịghị maka {product} na {old_lang}, anyị ebugharịala gị gaa na ọgbakọ ajụjụ {new_lang}.

source: The questions forum isn't available in {old_lang}, we have redirected you to the {new_lang} questions forum.
ig: Ọgbakọ ajụjụ adịghị na {old_lang}, anyị ebugharịala gị gaa na ọgbakọ ajụjụ {new_lang}.

source: The question: '{title}' was marked as solved by its asker, {asker}.
ig: Ajụjụ ahụ: akapụtara '{title}' dị ka nke ekpezigoro site n'aka onye jụrụ ya, {asker}.

source: There are no articles.
ig: Enweghị edemede ọ bụla.

source: There are no messages here.
ig: Enweghị ozi ọ bụla ebe a.

source: There are no threads. Maybe you should create some!
ig: Enweghị usoro ọ bụla. Tụlee ị mepụta ụfọdụ!

source: There are several ways in which you can get involved:
ig: Enwere ọtụtụ ụzọ ị nwere ike iji sonye:

source: There are {total} users with at least one contribution in the last 90 days.
ig: Enwere ndị ọrụ {total} nwere opekata mpe otu ntinye n'ụbọchị 90 gara aga.

source: The refund request must be made within 10 business days of purchase.
ig: A ga-emerịrị arịrịọ nkwụghachi ahụ n'ime ụbọchị azụmahịa 10 nke nzụta.

source: There is no flagged content pending moderation.
ig: Enweghị ọdịnaya akapụtara na eche nyocha.

source: There is no topic data available for the current selections.
ig: Enweghị data isiokwu dị maka nhọrọ ndị dị ugbu a.

source: The requested image could not be found.
ig: Enwenwughi ike ịchọta onyonyo arịọrọ.

source: There was an error.
ig: Enwere mperi.

source: There was an error checking for canned responses.
ig: Enwere mperi na ịlele nzaghachi ndị ezubere iche.

source: There was an error generating the preview.
ig: Mperi dapụtara ka a na emepụta nhụchalụ ahụ.

source: There was an error. Please try again in a moment.
ig: Enwere mperi. Biko nwaa ọzọ n'obere oge.

source: There was an error submitting the ticket. Please try again later.
ig: Enwere mperi na ịnyefe tiketi ahụ. Biko nwaa ọzọ ma emechaa.

source: There was an error submitting your vote.
ig: Enwere mperi na ịnyefe nhọpụta gị.

source: There was a problem confirming your subscription.
ig: Enwere nsogbu na ịkwenye na ndebanye gị.

source: There was a problem unsubscribing.
ig: Enwere nsogbu na iwepu aha.

source: There were errors adding leaders to the group, see below.
ig: Enwere mperi na itinye ndị isi n'otu ahụ, lee anya n'okpuru.

source: There were errors adding members to the group, see below.
ig: Enwere mperi na itinye ndị ọrụ n'otu ahụ, lee anya n'okpuru.

source: There were errors adding new contributors, see below.
ig: Enwere mperi na itinye ndị nkwado ọhụrụ, hụ n'okpuru.

source: There were errors adding users, see below.
ig: Enwere mperi na itinye ndị ọrụ, hụ okpuru.

source: These are the top 50 most visited articles in the last 30 days.
ig: Ndị a bụ edemede 50 akachasị gaa n'ụbọchị 30 gara aga.

source: These fine people helped write this article: %(contributors)s. You can help too - <a href="%(link)s">find out how</a>.
ig: Ndị ezigbo mmadụ ndị a nyere aka dee edemede a: %(contributors)s. Ị nwekwara ike ịnyere aka - <a href="%(link)s">chọpụta otu ọ bụ</a>.

source: These minor changes are not important for localizers and they will not be notified.
ig: Obere mgbanwe ndị a adịghị mkpa maka ndị na atụgharị asụsụ, agaghị ezigara ha ozi.

source: The {sitename} team
ig: Otu {sitename}

source: The slug provided is not valid.
ig: Slọg enyere anaghị arụ ọrụ.

source: The solution was undone successfully.
ig: Emeghasịrị asịsa ahụ na enweghị nsogbu.

source: The subject is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ig: Isiokwu ahụ dị oke mkpụmkpụ (mkpụrụedemede %(show_value)s). Ọ ga-abụrịrị opekata mpe mkpụrụedemede %(limit_value)s.

source: The SUMO Army of Awesome 2010 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2010; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2010 badge earners for advancing the Mozilla Mission!
ig: Obere-akara Igwe Ọmarịcha Ihe SUMO 2010 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite enyemaka na SUMO na 2010; na nke a: twiit Igwe Ọmarịcha Ihe 50. Ekele dịịrị ndị nrite akara Igwe Ọmarịcha Ihe SUMO 2010 maka itozu na Ebumnuche Mozilla!

source: The SUMO Army of Awesome 2011 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2011; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2011 badge earners for advancing the Mozilla Mission!
ig: Obere-akara Igwe Ọmarịcha Ihe SUMO 2011 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite enyemaka na SUMO na 2011; na nke a: twiit Igwe Ọmarịcha Ihe 50. Ekele dịịrị ndị nrite akara Igwe Ọmarịcha Ihe SUMO 2011 maka itozu na Ebumnuche Mozilla!

source: The SUMO Army of Awesome 2012 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2012; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2012 badge earners for advancing the Mozilla Mission!
ig: Obere-akara Igwe Ọmarịcha Ihe SUMO 2012 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite enyemaka na SUMO na 2012; na nke a: twiit Igwe Ọmarịcha Ihe 50. Ekele dịịrị ndị nrite akara Igwe Ọmarịcha Ihe SUMO 2012 maka itozu na Ebumnuche Mozilla!

source: The SUMO Army of Awesome 2013 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2013; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2013 badge earners for advancing the Mozilla Mission!
ig: Obere-akara Igwe Ọmarịcha Ihe SUMO 2013 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite enyemaka na SUMO na 2013; na nke a: twiit Igwe Ọmarịcha Ihe 50. Ekele dịịrị ndị nrite akara Igwe Ọmarịcha Ihe SUMO 2013 maka itozu na Ebumnuche Mozilla!

source: The SUMO Army of Awesome 2014 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2014; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2014 badge earners for advancing the Mozilla Mission!
ig: Obere-akara Igwe Ọmarịcha Ihe SUMO 2014 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite enyemaka na SUMO na 2014; na nke a: twiit Igwe Ọmarịcha Ihe 50. Ekele dịịrị ndị nrite akara Igwe Ọmarịcha Ihe SUMO 2014 maka itozu na Ebumnuche Mozilla!

source: The SUMO Forum 2010 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2010 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2010 badge earners for advancing the Mozilla Mission!
ig: Obere-akara Ọgbakọ SUMO 2010 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite ntinye aka na SUMO na 2010 n'okwu a: nzaghachi 30 na Ọgbakọ SUMO Bekee. Ekele dịịrị ndị nrite akara Ọgbakọ SUMO 2010 niile maka itozu na Ebumnuche Mozilla!

source: The SUMO Forum 2011 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2011 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2011 badge earners for advancing the Mozilla Mission!
ig: Obere-akara Ọgbakọ SUMO 2011 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite ntinye aka na SUMO na 2011 n'okwu a: nzaghachi 30 na Ọgbakọ SUMO Bekee. Ekele dịịrị ndị nrite akara Ọgbakọ SUMO 2011 niile maka itozu na Ebumnuche Mozilla!

source: The SUMO Forum 2012 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2012 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2012 badge earners for advancing the Mozilla Mission!
ig: Obere-akara Ọgbakọ SUMO 2012 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite ntinye aka na SUMO na 2012 n'okwu a: nzaghachi 30 na Ọgbakọ SUMO Bekee. Ekele dịịrị ndị nrite akara Ọgbakọ SUMO 2012 niile maka itozu na Ebumnuche Mozilla!

source: The SUMO Forum 2013 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2013 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2013 badge earners for advancing the Mozilla Mission
ig: Obere-akara Ọgbakọ SUMO 2013 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite ntinye aka na SUMO na 2013 n'okwu a: nzaghachi 30 na Ọgbakọ SUMO Bekee. Ekele dịịrị ndị nrite akara Ọgbakọ SUMO 2013 niile maka itozu na Ebumnuche Mozilla

source: The SUMO Forum 2014 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2014 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2014 badge earners for advancing the Mozilla Mission!
ig: Obere-akara Ọgbakọ SUMO 2014 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite ntinye aka na SUMO na 2014 n'okwu a: nzaghachi 30 na Ọgbakọ SUMO Bekee. Ekele dịịrị ndị nrite akara Ọgbakọ SUMO 2014 niile maka itozu na Ebumnuche Mozilla!

source: The SUMO KB 2010 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2010; in this case: 10 approved edits of the English SUMO Knowledge Base. Congrats to all SUMO KB 2010 badge earners for advancing the Mozilla Mission
ig: Obere-akara SUMO KB 2010 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite ntinye aka na SUMO na 2010; n'okwu a: ndezi 10 akwadoro nke Ọdụ Nghọta SUMO Bekee. Ekele dịịrị ndị nrite akara SUMO KB 2010 niile maka itozu na Ebumnuche Mozilla

source: The SUMO KB 2011 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2011; in this case: 10 approved edits of the English SUMO Knowledge Base. Congrats to all SUMO KB 2011 badge earners for advancing the Mozilla Mission!
ig: Obere-akara SUMO KB 2011 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite ntinye aka na SUMO na 2011; n'okwu a: ndezi 10 akwadoro nke Ọdụ Nghọta SUMO Bekee. Ekele dịịrị ndị nrite akara SUMO KB 2011 niile maka itozu na Ebumnuche Mozilla!

source: The SUMO KB 2012 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2012; in this case: 10 approved edits of the English SUMO Knowledge Base. Congrats to all SUMO KB 2012 badge earners for advancing the Mozilla Mission!
ig: Obere-akara SUMO KB 2012 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite ntinye aka na SUMO na 2012; n'okwu a: ndezi 10 akwadoro nke Ọdụ Nghọta SUMO Bekee. Ekele dịịrị ndị nrite akara SUMO KB 2012 niile maka itozu na Ebumnuche Mozilla!

source: The SUMO KB 2013 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2013 in this case: 10 approved edits of the English SUMO Knowledge Base. Congrats to all SUMO KB 2013 badge earners for advancing the Mozilla Mission!
ig: Obere-akara SUMO KB 2013 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite ntinye aka na SUMO na 2013 n'okwu a: ndezi 10 akwadoro nke Ọdụ Nghọta SUMO Bekee. Ekele dịịrị ndị nrite akara SUMO KB 2013 niile maka itozu na Ebumnuche Mozilla!

source: The SUMO KB 2014 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2014; in this case: 10 approved edits of the English SUMO Knowledge Base. Congrats to all SUMO KB 2014 badge earners for advancing the Mozilla Mission
ig: Obere-akara Ọgbakọ SUMO 2014 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite ntinye aka na SUMO na 2014 n'okwu a; nzaghachi 10 na Ọgbakọ SUMO Bekee. Ekele dịịrị ndị nrite akara Ọgbakọ SUMO 2014 niile maka itozu na Ebumnuche Mozilla

source: The SUMO L10n 2010 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2010; in this case: 10 approved translation edits of the SUMO Knowledge Base. Congrats to all SUMO L10n 2010 badge earners for advancing the Mozilla Mission!
ig: Obere-akara SUMO L10n 2010 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite ntinye aka na SUMO na 2010; n'okwu a: ndezi ntụgharị asụsụ 10 akwadoro nke Ọdụ Nghọta SUMO Bekee. Ekele dịịrị ndị nrite akara SUMO L10n 2010 niile maka itozu na Ebumnuche Mozilla!

source: The SUMO L10n 2011 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2011; in this case: 10 approved translation edits of the SUMO Knowledge Base. Congrats to all SUMO L10n 2011 badge earners for advancing the Mozilla Mission!
ig: Obere-akara SUMO L10n 2011 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite ntinye aka na SUMO na 2011; n'okwu a: ndezi ntụgharị asụsụ 10 akwadoro nke Ọdụ Nghọta SUMO Bekee. Ekele dịịrị ndị nrite akara SUMO L10n 2011 niile maka itozu na Ebumnuche Mozilla!

source: The SUMO L10n 2012 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2012; in this case: 10 approved translation edits of the SUMO Knowledge Base. Congrats to all SUMO L10n 2012 badge earners for advancing the Mozilla Mission!
ig: Obere-akara SUMO L10n 2012 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite ntinye aka na SUMO na 2012; n'okwu a: ndezi ntụgharị asụsụ 10 akwadoro nke Ọdụ Nghọta SUMO Bekee. Ekele dịịrị ndị nrite akara SUMO L10n 2012 niile maka itozu na Ebumnuche Mozilla!

source: The SUMO L10n 2013 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2013 in this case: 10 approved translation edits of the SUMO Knowledge Base. Congrats to all SUMO L10n 2013 badge earners for advancing the Mozilla Mission!
ig: Obere-akara SUMO L10n 2013 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite ntinye aka na SUMO na 2013 n'okwu a: ndezi ntụgharị asụsụ 10 akwadoro nke Ọdụ Nghọta SUMO. Ekele dịịrị ndị nrite akara SUMO L10n 2013 niile maka itozu na Ebumnuche Mozilla!

source: The SUMO L10n 2014 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2014; in this case: 10 approved translation edits of the SUMO Knowledge Base. Congrats to all SUMO L10n 2014 badge earners for advancing the Mozilla Mission!
ig: Obere-akara SUMO L10n 2014 bụ akụkụ nke nsotanso SUMO. Ọ na anọchite ntinye aka na SUMO na 2014; n'okwu a: ndezi ntụgharị asụsụ 10 akwadoro nke Ọdụ Nghọta SUMO Bekee. Ekele dịịrị ndị nrite akara SUMO L10n 2014 niile maka itozu na Ebumnuche Mozilla!

source: The template "%s" does not exist or has no approved revision.
ig: Ndebiri "%s" adịghị adị ma ọ bụ enweghị ngụgharị akwadoro.

source: The URL has changed!
ig: URL ahụ agbanweela!

source: The user name you entered is inappropriate. Please pick another and consider that our helpers are other Firefox users just like you.
ig: Aha njirimara i tinyere ezighi ezi. Biko họpụta ọzọ ma tụlee na ndị enyemaka anyị bụ ndị ọrụ Firefox ndị ọzọ dị ka gị.

source: The video "%s" does not exist.
ig: Vidio "%s" adịghị adị.

source: This account is already banned!
ig: Amachiela akaụntụ a!

source: This account is already being ignored!
ig: Elepụla anya na akaụntụ a ugbu a!
